{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"input_5": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"global_average_pooling2d_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/vggface_vgg16/conv1_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv1_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/global_average_pooling2d_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_5", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv1_1/Conv2D", "op": "Conv2D", "input": ["input_5", "StatefulPartitionedCall/vggface_vgg16/conv1_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv1_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv1_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv1_1/Relu", "StatefulPartitionedCall/vggface_vgg16/conv1_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/pool1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vggface_vgg16/conv1_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/pool1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv1_2/Relu", "StatefulPartitionedCall/vggface_vgg16/conv2_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv2_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv2_1/Relu", "StatefulPartitionedCall/vggface_vgg16/conv2_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/pool2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vggface_vgg16/conv2_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/pool2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv2_2/Relu", "StatefulPartitionedCall/vggface_vgg16/conv3_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv3_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv3_1/Relu", "StatefulPartitionedCall/vggface_vgg16/conv3_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv3_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv3_2/Relu", "StatefulPartitionedCall/vggface_vgg16/conv3_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/pool3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vggface_vgg16/conv3_3/Conv2D"], "attr": {"explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/pool3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv3_3/Relu", "StatefulPartitionedCall/vggface_vgg16/conv4_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv4_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv4_1/Relu", "StatefulPartitionedCall/vggface_vgg16/conv4_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv4_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv4_2/Relu", "StatefulPartitionedCall/vggface_vgg16/conv4_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/pool4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vggface_vgg16/conv4_3/Conv2D"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/pool4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_1/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv4_3/Relu", "StatefulPartitionedCall/vggface_vgg16/conv5_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv5_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv5_1/Relu", "StatefulPartitionedCall/vggface_vgg16/conv5_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/conv5_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/vggface_vgg16/conv5_2/Relu", "StatefulPartitionedCall/vggface_vgg16/conv5_3/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/pool5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/vggface_vgg16/conv5_3/Conv2D"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/vggface_vgg16/pool5/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/vggface_vgg16/global_average_pooling2d_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/vggface_vgg16/conv5_3/Relu", "StatefulPartitionedCall/vggface_vgg16/global_average_pooling2d_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/vggface_vgg16/global_average_pooling2d_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/vggface_vgg16/conv1_1/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3811927535954644, "scale": 0.0030991280780119056, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv1_2/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16351952506046669, "scale": 0.0016685665822496602, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_1/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.28683479147798874, "scale": 0.0029570597059586467, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv2_2/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21225521400863048, "scale": 0.0017117355968437943, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_1/Conv2D/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23884906488306384, "scale": 0.0018094626127504836, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_2/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11537183756921807, "scale": 0.0009304180449130489, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv3_3/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11971811795351552, "scale": 0.0010594523712700488, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_1/Conv2D/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12610445303075454, "scale": 0.0010508704419229546, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06866403771381752, "scale": 0.0006242185246710684, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv4_3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06442195901683732, "scale": 0.0006194419136234358, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_1/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07823480566342672, "scale": 0.0006744379798571269, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_2/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06600467597737032, "scale": 0.000550038966478086, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/conv5_3/Conv2D/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07378745324471418, "scale": 0.0006832171596732794, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/vggface_vgg16/global_average_pooling2d_1/Mean/reduction_indices", "shape": [2], "dtype": "int32"}]}]}